export default {
  home: {
    title: 'Страница Home'
  },
  changePasswordForm: {
    title: 'Изменить пароль',
    submit: 'Изменить пароль',
    password: 'Пароль',
    passwordConfirmation: 'Повторите пароль',
    confirmationErr: 'Пароли не совпадают',
    required: 'Это обязательное поле',
    minLength: 'Пожалуйста, введите не менее 6 символов',
    maxLength: 'Пожалуйста, введите не более 30 символов',
  },
  ForgotPasswordForm: {
    title: 'Забыли свой пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    submit: 'Пришлите мне инструкции по сбросу пароля',
    required: 'Это обязательное поле',
  },
  ResendConfirmationForm: {
    title: 'Забыли свой пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    submit: 'Пришлите мне инструкции по сбросу пароля',
    required: 'Это обязательное поле',
  },
  SingInForm: {
    title: 'Вход в учетную запись',
    submit: 'Войти',
    password: 'Пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    required: 'Это обязательное поле',
    minLength: 'Пожалуйста, введите не менее 6 символов',
    maxLength: 'Пожалуйста, введите не более 30 символов',
  },
  SignUpForm: {
    title: 'Форма регистрации',
    submit: 'Зарегистрироваться',
    password: 'Пароль',
    passwordConfirmation: 'Повторите пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    required: 'Это обязательное поле',
    minLength: 'Пожалуйста, введите не менее 6 символов',
    maxLength: 'Пожалуйста, введите не более 30 символов',
    confirmationErr: 'Пароли не совпадают',
  }
}
