export default {
  home: {
    title: 'Страница Home'
  },
  changePasswordForm: {
    title: 'Изменить пароль',
    submit: 'Изменить пароль',
    password: 'Пароль',
    passwordConfirmation: 'Повторите пароль',
    confirmationErr: 'Пароли не совпадают',
    required: 'Это обязательное поле',
    minLength: 'Пожалуйста, введите не менее 6 символов',
    maxLength: 'Пожалуйста, введите не более 30 символов',
  },
  ForgotPasswordForm: {
    title: 'Забыли свой пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    submit: 'Пришлите мне инструкции по сбросу пароля',
    required: 'Это обязательное поле',
  },
  ResendConfirmationForm: {
    title: 'Забыли свой пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    submit: 'Пришлите мне инструкции по сбросу пароля',
    required: 'Это обязательное поле',
  },
  SingInForm: {
    title: 'Вход в учетную запись',
    submit: 'Войти',
    password: 'Пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    required: 'Это обязательное поле',
    minLength: 'Пожалуйста, введите не менее 6 символов',
    maxLength: 'Пожалуйста, введите не более 30 символов',
  },
  SignUpForm: {
    title: 'Форма регистрации',
    submit: 'Зарегистрироваться',
    password: 'Пароль',
    passwordConfirmation: 'Повторите пароль',
    email: 'Электронная почта',
    emailErr: 'Неверный адрес электронной почты',
    required: 'Это обязательное поле',
    minLength: 'Пожалуйста, введите не менее 6 символов',
    maxLength: 'Пожалуйста, введите не более 30 символов',
    confirmationErr: 'Пароли не совпадают',
  },
  CookiesNotifying: {
    text: 'Мы используем файлы cookie для персонализации контента и рекламы,' +
      ' предоставления функций ' + 'социальных ' + 'сетей и анализа нашего трафика. ' +
      'Мы также делимся информацией ' +
      'об использовании вами нашего ' +
      'сайта с нашими партнерами по социальным сетям, рекламе и аналитике, ' +
      'которые могут объединять ' +
      'ее с другой информацией, которую вы им предоставили или которую ' +
      'они собрали в результате ' +
      'использования вами их услуг.',
    button: 'Принять и закрыть'
  }
}
